In [4]:
import pandas as pd

# Load Dataset

In [5]:
test = pd.read_csv('../lectureMaterials/sample_data_titanic/test.csv', index_col = "PassengerId")
print(test.shape)
test.head(2)

(418, 10)

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

# Preprocessing

## Encode Sex

In [7]:
test['Sex_encode'] = test['Sex'].replace('male', 0) \
                                .replace('female', 1)
print(test.shape)
test[['Sex', 'Sex_encode']].head()

(418, 11)

                Sex  Sex_encode
PassengerId
892            male           0
893          female           1
894            male           0
895            male           0
896          female           1

## Fill in missing Fare

In [8]:
test[test['Fare'].isnull()]

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_encode
PassengerId,,,,,,,,,,,
1044,3,"Storey, Mr. Thomas",male,60.5,0,0,3701,NaN,NaN,S,0

In [11]:
test['Fare'] = test['Fare'].fillna(0)
test[test['Fare'].isnull()]

Empty DataFrame
Columns: [Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked, Sex_encode]
Index: []

## Embarked Column

In [12]:
test['Embarked'].head()

PassengerId
892    Q
893    S
894    Q
895    S
896    S
Name: Embarked, dtype: object

In [13]:
test['Embarked_C'] = test['Embarked'] == "C"
test['Embarked_S'] = test['Embarked'] == "S"
test['Embarked_Q'] = test['Embarked'] == "Q"
print(test.shape)
test[['Embarked', 'Embarked_C', 'Embarked_S', 'Embarked_Q']].head()

(418, 14)

            Embarked  Embarked_C  Embarked_S  Embarked_Q
PassengerId
892                Q       False       False        True
893                S       False        True       False
894                Q       False       False        True
895                S       False        True       False
896                S       False        True       False

## Test

In [14]:
feature_name = ['Pclass', 'Sex_encode', 'Fare', 'Embarked_C', 'Embarked_S', "Embarked_Q"]
feature_name

['Pclass', 'Sex_encode', 'Fare', 'Embarked_C', 'Embarked_S', 'Embarked_Q']

In [18]:
X_test = test[feature_name]
print(X_test.shape)
X_test.head()

(418, 6)

             Pclass  Sex_encode     Fare  Embarked_C  Embarked_S  Embarked_Q
PassengerId
892               3           0   7.8292       False       False        True
893               3           1   7.0000       False        True       False
894               2           0   9.6875       False       False        True
895               3           0   8.6625       False        True       False
896               3           1  12.2875       False        True       False